etc/demo_data/service_advisor_feed.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://api.gladmindsplatform.co/api/v1/bajaj/feed/">
  <SOAP-ENV:Body>
    <ns1:postDealer>
      <ns1:ObjectList>
        <ns1:DealerData>
          <ns1:DealerModel>
            <ns1:ACTIVE_FLAG>Y</ns1:ACTIVE_FLAG>
            <ns1:TIMESTAMP>2014-04-01000000</ns1:TIMESTAMP>
            <ns1:SER_ADV_MOBILE>+919845623187</ns1:SER_ADV_MOBILE>
            <ns1:SER_ADV_ID>HISA001</ns1:SER_ADV_ID>
            <ns1:ADDRESS>Marathalli</ns1:ADDRESS>
            <ns1:SER_ADV_NAME>TestUser01</ns1:SER_ADV_NAME>
            <ns1:KUNNR>HIDealer001</ns1:KUNNR>
          </ns1:DealerModel>
          <ns1:DealerModel>
            <ns1:ACTIVE_FLAG>Y</ns1:ACTIVE_FLAG>
            <ns1:TIMESTAMP>2014-04-01000000</ns1:TIMESTAMP>
            <ns1:SER_ADV_MOBILE>+919845350297</ns1:SER_ADV_MOBILE>
            <ns1:SER_ADV_ID>HISA002</ns1:SER_ADV_ID>
            <ns1:ADDRESS>HSR LAYOUT</ns1:ADDRESS>
            <ns1:SER_ADV_NAME>TestUser02</ns1:SER_ADV_NAME>
            <ns1:KUNNR>HIDealer001</ns1:KUNNR>
          </ns1:DealerModel>
        </ns1:DealerData>
      </ns1:ObjectList>
      <ns1:Credential>
        <ns1:UserName>bajaj001</ns1:UserName>
        <ns1:Password>bajaj001</ns1:Password>
      </ns1:Credential>
    </ns1:postDealer>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
